rails-rak/app/controllers/organizations_controller.rb

  def index
    @organizations = Organization.all.order(:id)
---
SELECT "organizations".* FROM "organizations" ORDER BY "organizations"."id" ASC

  def show
    @organization = Organization.find(params[:id])
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]