rails-rak/app/controllers/projects_controller.rb

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
INSERT INTO "projects" ("project_name", "street_address", "city", "state", "zip_code", "description", "organization_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
	def create
		authenticate_organization # method comes from Knock gem
	  @project = Project.new(project_params)
		@organization = Organization.find(params[:organization_id])
		@project.organization = @organization

		if project_params[:event]
			@project.event = Event.find_or_create_by(name: project_params[:event])